9/data/attachments/5c6b3fe54a9a3366.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_c5b21c29-f198-4567-aa82-797cd4783e46</nif:username>
            <nif:friendToBeAdded>Leah_thus_Friend_83823_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>